# -*- coding:utf8 -*-
# @author:zhangzhipeng
# @date:2015-04-10


import project_tornado.utils.json as json

#TODO:这里需要重构，Ex: SERVER_ERROR = 1 = "系统错误"
ENUM_ERROR_CODE = {
    "0": "",
    "1": "未知错误",

    "10001": "系统错误",
    "10002": "服务暂停",
    "10003": "远程服务错误",
    "10004": "ip被禁止",
    "10005": "授权错误",
    "10006": "缺少参数",
    "10007": "参数错误，请参考文档",
    "10008": "系统繁忙",
    "10009": "非法请求",
    "10010": "api不存在",
    "10011": "请求方式错误",

    "20001": "客户端未授权",
    "20002": "客户端id为空",
    "20003": "客户端异常，操作非法",
    "20004": "访问频繁",
    "20005": "提交内容相似",
    "20006": "提交内容相同",
    "20007": "客户端id不合法",
    "20008": "客户端id不存在",
    "20009": "客户端授权超时",
    "20010": "客户端登录失败",
    "20011": "服务端正在验证授权",
    "20012": "服务端创建失败",
    "20013": "服务端已登录",
    "20014": "服务端登陆成功",

    "21001": "任务id为空",
    "21002": "任务不存在",
    "21003": "任务已提交",
    "21004": "任务创建失败",
    "21005": "任务已完成",
    "21006": "任务已取消",
    "21007": "任务被其他客户端获取",
    "21008": "请为任务添加存储表",

    "22001": "md5不合法",
    "22002": "md5为空",
    "22003": "md5验证失败",

    "22004": "文件名不合法",
    "22005": "文件名为空",
    "22006": "文件不存在",
    "22007": "文件保存失败",

    "23001": "任务名不合法",
    "23002": "任务名不合法",
    "23003": "配置文件异常",
    "23004": "上传文件不完整",
    "23005": "用户名为空",
    "23006": "父任务不正确",
    "23007": "存储到哪张表，参数不正确",
    "23008": "建表sql不正确",
    "23009": "创建成功",
    "23010": "任务创建失败",
    "23011": "表创建失败",
    "23012": "文件存储路径不正确",

    "24001":"任务获取失败",
    "24002":"尚无任务",
    "24003":"任务获取失败，还有任务未完成",

    "25001":"Permission Denied",
}


class ApiEntity(object):
    code = 0
    message = ""

    def __init__(self):
        pass

    def __str__(self):
        keys = [i for i in dir(self) if not i.startswith("__")]
        data = {}
        for key in keys:
            data[key] = getattr(self, key)
        return json.dumps(data)

    def to_json(self):
        keys = [i for i in dir(self) if not i.startswith("__")]
        data = {}
        for key in keys:
            data[key] = getattr(self, key)
        return data

    def __miss__(self, key):
        return ""
